{
  "Projects": [
    {
      "title": "Airbnb Application",
      "desc": [
        "An Airbnb clone web application built with the MERN stack (MongoDB, Express.js, React.js, Node.js) and styled using Tailwind CSS and Shadcn. Users can search for accommodations, view detailed listings, make bookings, and manage their own property listings. The application supports secure user authentication with JWT and allows Google-based login via Google Cloud. Images are efficiently managed using Cloudinary, ensuring smooth and fast delivery.",
        "This project showcases my expertise in full-stack web development and my ability to build a feature-rich, user-friendly platform. The application is designed to mimic the core functionalities of Airbnb while maintaining a modern and responsive interface. Its robust design ensures seamless user interaction and optimal performance across devices, making it a practical and scalable solution."
      ],
      
      "year": "2023",
      "preview": "https://ease-nest.netlify.app/",
      "code": "https://github.com/Anshu10101/Airbnb-full-stack-",
      "images": [
        "/projects/trivia/trivia1.png",
        "/projects/trivia/trivia2.png",
        "/projects/trivia/trivia3.png"
      ],
      "tech": ["ReactJs", "NodeJs", "ExpressJs", "MongoDB", "TailwindCSS", "JWT", "Cloudinary", "Google cloud"],
      "slug": "trivia"
    },
    {
      "title": "E-Learning Platform",
      "desc": [
        "An E-learning platform designed for students in grades 9-12, focusing on JEE and NEET preparation. Built collaboratively by a team of 3, the platform provides dynamic content, interactive practice tests, and an optimized learning experience. It supports real-time updates for seamless navigation and serves 500+ active users on Mahatma Hansraj School's local servers in Jhansi.",
        "This project reflects my commitment to creating impactful educational solutions using modern web technologies. Developed with PHP, MySQL, Apache, Ajax, jQuery, and Bootstrap, the platform ensures scalability and reliability. The user-friendly interface and tailored features make it an effective tool for students, highlighting my ability to design robust and student-focused applications."
      ],
      "year": "2020",
      "images": [
        "/projects/saku-senyum/saku-senyum1.png"
      ],
      "tech": [
        "PHP", "Laravel", "Bootstrap", "MySQL", "jQuery", "Apache", "Ajax"
      ], 
      "slug": "saku-senyum"
    },
    {
      "title": "LUDOang",
      "desc": [
        "LUDOang is a game that my team and I created for a final project in my university. The game is built python, pygame, and OpenGL. The game is a 2D game that is inspired by a Ludo game. The game has a few features such randomZone, and a 3D dice.",
        "RandomZone is a feature that allows the player to get a random number of steps. The 3D dice is a feature that allows the player to roll a 3D dice. The game also has a few other features menuy screen and also loading screen.", "Beside that the game also has a audio theme that will play when the game is started. The game also has a few sound effects such as dice roll sound, and a sound when the player win the game."
      ],
      "year": "2023",
      "preview": "https://github.com/Alvalens/ludo-game/releases/tag/pre-release",
      "code": "https://github.com/Alvalens/ludo-game",
      "images": [
        "/projects/LUDOang/ludo1.png",
        "/projects/LUDOang/ludo2.png",
        "/projects/LUDOang/ludo3.png"
      ],
      "tech": [
        "Python",
        "Pygame",
        "OpenGL"
      ], 
      "slug": "ludoang"
    },
    {
      "title": "React Realtime Chat",
      "desc": [
        "An ambitious project built with the MERN stack, focusing on real-time communication. This chat application supports JWT authentication, real-time messaging using Socket.io, and online user status tracking with React Context. TailwindCSS and Daisy UI are used for a modern and responsive design.",
        "This project allowed me to explore advanced web development concepts such as global state management with Zustand, server and client-side error handling, and efficient deployment strategies. It provided valuable experience in building a feature-rich, scalable real-time application."
      ],
      "year": "2023",
      "preview": "",
      "code": "",
      "images": [
        "/projects/chat/chat1.png",
        "/projects/chat/chat2.png",
        "/projects/chat/chat3.png",
        "/projects/chat/chat4.png"
      ],
      "tech": ["JavaScript", "React", "React Router", "Firebase", "Daisy UI"],
      "slug": "react-chat"
    },
    {
      "title": "React Tools",
      "desc": [
        "React Tools is a groundbreaking and user-friendly project that brings together a comprehensive collection of tools and components crafted with cutting-edge technologies, including React, React Router, and TailwindCSS. What sets this project apart is that it's not just a suite of powerful features, but it's also a significant milestone as it marks my very first venture into the world of React development.",

        "Unlike traditional web applications, React Tools cleverly utilizes browser local storage, eliminating the need for external databases. This not only ensures seamless performance but also prioritizes user data privacy. ",

        "The Todo List keeps tasks in check with intuitive task management capabilities, ensuring you never miss a beat. The note-taking feature provides a hassle-free way to jot down ideas and crucial information, accessible whenever inspiration strikes. Additionally, our robust expense tracker simplifies financial management by recording and categorizing expenses, delivering insightful spending analysis."
      ],
      "year": "2023",
      "preview": "https://react-tools-two.vercel.app/",
      "code": "https://github.com/Anshu10101/Airbnb-full-stack-",
      "images": [
        "/projects/tools/tools.png",
        "/projects/tools/tools1.png",
        "/projects/tools/tools2.png",
        "/projects/tools/tools3.png"
      ],
      "tech": [
        "Javascript",
        "React",
        "React Router",
        "TailwindCSS"
      ],
      "slug": "react-tools"
    },
    {
      "title": "Aleph Discord Bot",
      "desc": [
        "Aleph is a Discord bot that I created for my dircord server to use. The bot is built using Python and the discord.py library. The bot has image grabber feauture that takes argument (keywords) and returns an image from the internet.", "Other than that this bot has a few other features such as utility command to delete a messages, and a command to get the server's ping. This bot is still in development and I plan to add more features in the future."],
      "year": "2023",
      "preview": "",
      "code": "https://github.com/Alvalens/aleph-discord-bot",
      "images": [
        "/projects/bot/bot1.png",
        "/projects/bot/bot2.png"
      ],
      "tech": [
        "Python",
        "Discord.py",
        "Google Serp API"
      ],
      "slug": "aleph-discord-bot"
    }, 
    {
      "title": "Football Match Analysis System",
      "desc": [
        "A cutting-edge project leveraging computer vision and YOLO object detection to analyze football matches. The system tracks players, referees, and the ball, enabling team identification, ball control tracking, and player movement analysis for comprehensive match insights.",
        "This project integrates advanced techniques such as K-means clustering, optical flow, and perspective transformation to deliver real-world sports analytics. It provides crucial data on speed, distance, and team performance, making it highly relevant for sports management and coaching."
      ],
      "year": "2023",
      "code": "https://github.com/Anshu10101/Football-Analysis-System",
      "images": ["/projects/lptk/lptk1.png", "/projects/lptk/lptk2.png"],
      "tech": [
        "Python",
        "Ultralytics",
        "Tensorflow",
        "OpenCV",
        "Keras",
        "NumPy",
        "Roboflow",
        "Supervision",
        "Matplotlib",
        "Scikit-learn"
      ],
      "slug": "lptk-cup-2023"
    }, 
    {
      "title": "Coming Soon",
      "desc": [
        ""],
      "year": "",
      "preview": "",
      "code": "",
      "images": [
        ""
      ],
      "tech": [
        ""
      ],
      "slug": "nu-ino-website"
    }
  ]
}
