{
  "Projects": [
    {
      "title": "Airbnb Application",
      "desc": [
        "An Airbnb clone web application built with the MERN stack (MongoDB, Express.js, React.js, Node.js) and styled using Tailwind CSS and Shadcn. Users can search for accommodations, view detailed listings, make bookings, and manage their own property listings. The application supports secure user authentication with JWT and allows Google-based login via Google Cloud. Images are efficiently managed using Cloudinary, ensuring smooth and fast delivery.",
        "This project showcases my expertise in full-stack web development and my ability to build a feature-rich, user-friendly platform. The application is designed to mimic the core functionalities of Airbnb while maintaining a modern and responsive interface. Its robust design ensures seamless user interaction and optimal performance across devices, making it a practical and scalable solution."
      ],
      
      "year": "2024",
      "preview": "https://ease-nest.netlify.app/",
      "code": "https://github.com/Anshu10101/Airbnb-full-stack-",
      "images": [
        "/projects/Airbnb/Airbnb1.png",
        "/projects/Airbnb/Airbnb2.png",
        "/projects/Airbnb/Airbnb3.png"
      ],
      "tech": ["ReactJs", "NodeJs", "ExpressJs", "MongoDB", "TailwindCSS", "JWT", "Cloudinary", "Google cloud"],
      "slug": "Airbnb"
    },
    {
      "title": "AI Powered Multi PDF Chatbot",
      "desc": [
        " The Multi-PDF Chat AI Agent is a Streamlit app that lets users interact with multiple PDFs using AI. It extracts text, processes queries, and delivers accurate responses powered by Google Gemini Pro and FAISS for efficient document-based Q&A.."
      ],
      "year": "2025",
      "code": "https://github.com/Anshu10101/AI-Powered-Multi-PDF-Chatbot",
      "images": [
        "/projects/AI_chatbot/ELP.png", "/projects/AI_chatbot/LLMAgents.png"
      ],
      "tech": [
        "Streamlit", "Google Gemini AI", "Python", "LangChain", "PyPDF2", "FAISS", "Python dotenv"
      ], 
      "slug": "AI_chatbot"
    },
    {
      "title": "React Realtime Chat",
      "desc": [
        "An ambitious project built with the MERN stack, focusing on real-time communication. This chat application supports JWT authentication, real-time messaging using Socket.io, and online user status tracking with React Context. TailwindCSS and Daisy UI are used for a modern and responsive design.",
        "This project allowed me to explore advanced web development concepts such as global state management with Zustand, server and client-side error handling, and efficient deployment strategies. It provided valuable experience in building a feature-rich, scalable real-time application."
      ],
      "year": "2024",
      "preview": "",
      "code": "",
      "images": [
        "/projects/chat/chat1.png"
      ],
      "tech": ["JavaScript", "React", "React Router", "Firebase", "Daisy UI"],
      "slug": "react-chat"
    },
    {
      "title": "React Tools",
      "desc": [
        "React Tools is a groundbreaking and user-friendly project that brings together a comprehensive collection of tools and components crafted with cutting-edge technologies, including React, React Router, and TailwindCSS. What sets this project apart is that it's not just a suite of powerful features, but it's also a significant milestone as it marks my very first venture into the world of React development.",

        "Unlike traditional web applications, React Tools cleverly utilizes browser local storage, eliminating the need for external databases. This not only ensures seamless performance but also prioritizes user data privacy. ",

        "The Todo List keeps tasks in check with intuitive task management capabilities, ensuring you never miss a beat. The note-taking feature provides a hassle-free way to jot down ideas and crucial information, accessible whenever inspiration strikes. Additionally, our robust expense tracker simplifies financial management by recording and categorizing expenses, delivering insightful spending analysis."
      ],
      "year": "2024",
      "preview": "https://react-tools-two.vercel.app/",
      "code": "https://github.com/Anshu10101/React-Tools",
      "images": [
        "/projects/tools/tools.png",
        "/projects/tools/tools1.png",
        "/projects/tools/tools2.png",
        "/projects/tools/tools3.png"
      ],
      "tech": [
        "Javascript",
        "React",
        "React Router",
        "TailwindCSS"
      ],
      "slug": "react-tools"
    },
    {
      "title": "Football Match Analysis System",
      "desc": [
        "A cutting-edge project leveraging computer vision and YOLO object detection to analyze football matches. The system tracks players, referees, and the ball, enabling team identification, ball control tracking, and player movement analysis for comprehensive match insights.",
        "This project integrates advanced techniques such as K-means clustering, optical flow, and perspective transformation to deliver real-world sports analytics. It provides crucial data on speed, distance, and team performance, making it highly relevant for sports management and coaching."
      ],
      "year": "2025",
      "code": "https://github.com/Anshu10101/Football-Analysis-System",
      "images": ["/projects/lptk/lptk1.png", "/projects/lptk/lptk2.png"],
      "tech": [
        "Python",
        "Ultralytics",
        "Tensorflow",
        "OpenCV",
        "Keras",
        "NumPy",
        "Roboflow",
        "Supervision",
        "Matplotlib",
        "Scikit-learn"
      ],
      "slug": "FAS"
    }, 
    {
      "title": "TraviAI - AI Powered Travel Companion",
      "desc": [
        "TraviAI is an AI-based travel planning application designed to make trip planning easier and more efficient. This project leverages artificial intelligence to analyze user preferences and provide personalized recommendations for destinations, accommodations, and activities."],
      "year": "2025",
      "preview": "https://travi-ai-ai-powered-travel-companion.vercel.app/",
      "code": "https://github.com/Anshu10101/TraviAI---AI-Powered-Travel-Companion",
      "images": [
        "/projects/Travel/ino1.png", "/projects/Travel/ino2.png"
        
      ],
      "tech": [
        "React", "TailwindCSS", "Google Cloud", "Gemini AI", "Firebase", "Auth0", "React Hot Toast"
      ],
      "slug": "Travel"
    },
    {
      "title": "DripiFY - Fashion E-commerce Platform",
      "desc": [
        "DripiFY is a cutting-edge e-commerce platform designed to revolutionize the fashion industry. This project showcases my expertise in full-stack web development and my ability to create a feature-rich, user-friendly platform. The application is built with the MERN stack (MongoDB, Express.js, React.js, Node.js) and styled using Tailwind CSS and Shadcn.",
        "DripiFY offers a seamless shopping experience with advanced features such as product filtering, sorting, and search functionality. Users can create accounts, add products to their cart, and complete secure transactions. The platform also supports admin functionalities for managing products, orders, and user accounts."
      ],
      "year": "2024",
      "preview": "https://dripify-fashion-e-commerce.vercel.app/",
      "code": "https://github.com/Anshu10101/DripiFY-Fashion-E-Commerce",
      "images": [
        "/projects/eCommerce/e-com.png"
        
      ],
      "tech": [
        "ReactJS", "NextJS", "TailwindCSS"
      ],
      "slug": "eCommerce"
    }
  ]
}
